publish/2020/install-mecab-on-ubuntu-20.04.1LTS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2020-09-12 Sat 07:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>/bin/sh: 1: mecab-config: not found と RuntimeError</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="clothoid" />
<meta name="keywords" content="ubuntu mecab mecab-config not found python pip iconv g++ RuntimeError" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://clothoid.github.io/sitemap.html"> UP </a>
 |
 <a accesskey="H" href="https://clothoid.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">/bin/sh: 1: mecab-config: not found と RuntimeError</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9ba77f2">1. 環境</a></li>
<li><a href="#org5f182c4">2. 手順</a></li>
<li><a href="#org0f24e39">3. 確認</a></li>
<li><a href="#org20f6ad3">4. 経緯</a></li>
<li><a href="#org6b8c509">5. 試行錯誤の手順</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9ba77f2" class="outline-2">
<h2 id="org9ba77f2"><span class="section-number-2">1</span> 環境</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Ubuntu 20.04.1 LTS</li>
<li>Python 3.8.2</li>
<li>pip 20.0.2 from /usr/lib/python3/dist-packages/pip (python 3.8)</li>
<li>iconv (Ubuntu GLIBC 2.31-0ubuntu9) 2.31</li>
<li>g++ (Ubuntu 9.3.0-10ubuntu2) 9.3.0</li>
<li>mecab of 0.996</li>
<li>mecab-config 0.996</li>
<li>python package mecab-0.996.2</li>
</ul>
</div>
</div>

<div id="outline-container-org5f182c4" class="outline-2">
<h2 id="org5f182c4"><span class="section-number-2">2</span> 手順</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">sudo apt update
sudo apt install mecab libmecab-dev mecab-ipadic mecab-ipadic-utf8 -y 
sudo pip3 install mecab
</pre>
</div>
</div>
</div>

<div id="outline-container-org0f24e39" class="outline-2">
<h2 id="org0f24e39"><span class="section-number-2">3</span> 確認</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">!/usr/bin/env python3</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">-*- mode: python coding: utf-8 -*-</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">MeCab&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;</span>
<span style="color: #0000FF;">import</span> MeCab

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#20998;&#12363;&#12385;&#26360;&#12365;&#12398;&#12497;&#12540;&#12469;&#12540;&#12434;&#25351;&#23450;</span>
<span style="color: #333333; background-color: #FFFFFF;">parser</span> = MeCab.Tagger(<span style="color: #008000;">"-Owakati"</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#35299;&#26512;&#23550;&#35937;</span>
<span style="color: #333333; background-color: #FFFFFF;">text</span> = <span style="color: #008000;">"&#31169;&#12399;&#22303;&#26332;&#26085;&#12395;&#12469;&#12483;&#12459;&#12540;&#12434;&#35251;&#12414;&#12377;&#12290;"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#22793;&#25968;text&#12398;&#20998;&#12363;&#12385;&#26360;&#12365;&#12434;&#34892;&#12358;</span>
<span style="color: #333333; background-color: #FFFFFF;">ans</span> = parser.parse(text)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#32080;&#26524;&#12398;&#34920;&#31034;</span>
<span style="color: #0000FF;">print</span>(ans)                             <span style="color: #8D8D84; font-style: italic;"># =&gt; &#31169; &#12399; &#22303;&#26332;&#26085; &#12395; &#12469;&#12483;&#12459;&#12540; &#12434; &#35251; &#12414;&#12377; &#12290;</span><span style="color: #E8E8E8; background-color: #FFFFAB;"> </span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">!/usr/bin/env python3</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">-*- mode: python coding: utf-8 -*-</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">MeCab&#12398;&#12452;&#12531;&#12509;&#12540;&#12488;</span>
<span style="color: #0000FF;">import</span> MeCab

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#20998;&#12363;&#12385;&#26360;&#12365;&#12398;&#12497;&#12540;&#12469;&#12540;&#12434;&#25351;&#23450;</span>
<span style="color: #333333; background-color: #FFFFFF;">parser</span> = MeCab.Tagger(<span style="color: #008000;">"-Ochasen"</span>)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#35299;&#26512;&#23550;&#35937;</span>
<span style="color: #333333; background-color: #FFFFFF;">text</span> = <span style="color: #008000;">"&#31169;&#12399;&#22303;&#26332;&#26085;&#12395;&#12469;&#12483;&#12459;&#12540;&#12434;&#35251;&#12414;&#12377;&#12290;"</span>

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#22793;&#25968;text&#12398;&#20998;&#12363;&#12385;&#26360;&#12365;&#12434;&#34892;&#12358;</span>
<span style="color: #333333; background-color: #FFFFFF;">ans</span> = parser.parse(text)

<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#32080;&#26524;&#12398;&#34920;&#31034;</span>
<span style="color: #0000FF;">print</span>(ans)
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">=&gt;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#31169;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#12527;&#12479;&#12471;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#31169;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#21517;&#35422;-&#20195;&#21517;&#35422;-&#19968;&#33324;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#12399;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#12495;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#12399;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#21161;&#35422;-&#20418;&#21161;&#35422;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#22303;&#26332;&#26085;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#12489;&#12520;&#12454;&#12499;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#22303;&#26332;&#26085;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#21517;&#35422;-&#21103;&#35422;&#21487;&#33021;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#12395;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#12491;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#12395;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#21161;&#35422;-&#26684;&#21161;&#35422;-&#19968;&#33324;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#12469;&#12483;&#12459;&#12540;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#12469;&#12483;&#12459;&#12540;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#12469;&#12483;&#12459;&#12540;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#21517;&#35422;-&#19968;&#33324;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#12434;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#12530;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#12434;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#21161;&#35422;-&#26684;&#21161;&#35422;-&#19968;&#33324;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#35251;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#12511;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#35251;&#12427;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#21205;&#35422;-&#33258;&#31435;</span><span style="color: #E8E8E8; background-color: #ffffff;">   </span><span style="color: #8D8D84; font-style: italic;">&#19968;&#27573;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#36899;&#29992;&#24418;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#12414;&#12377;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#12510;&#12473;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#12414;&#12377;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#21161;&#21205;&#35422;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#29305;&#27530;&#12539;&#12510;&#12473;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#22522;&#26412;&#24418;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">&#12290;</span><span style="color: #E8E8E8; background-color: #ffffff;">    </span><span style="color: #8D8D84; font-style: italic;">&#12290;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#12290;</span><span style="color: #E8E8E8; background-color: #ffffff;">  </span><span style="color: #8D8D84; font-style: italic;">&#35352;&#21495;-&#21477;&#28857;</span>
<span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">EOS</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org20f6ad3" class="outline-2">
<h2 id="org20f6ad3"><span class="section-number-2">4</span> 経緯</h2>
<div class="outline-text-2" id="text-4">
<p>
python で mecab を利用しようと思い、pipしたら以下のエラーが発生。
</p>

<pre class="example">
lothoid@silverstone:~$ sudo pip3 install mecab
Collecting mecab
  Using cached mecab-0.996.2.tar.gz (62 kB)
    ERROR: Command errored out with exit status 1:
     command: /usr/bin/python3 -c 'import sys, setuptools, tokenize; sys.argv[0] = '"'"'/tmp/pip-install-hjqmz7zd/mecab/setup.py'"'"'; __file__='"'"'/tmp/pip-install-hjqmz7zd/mecab/setup.py'"'"';f=getattr(tokenize, '"'"'open'"'"', open)(__file__);code=f.read().replace('"'"'\r\n'"'"', '"'"'\n'"'"');f.close();exec(compile(code, __file__, '"'"'exec'"'"'))' egg_info --egg-base /tmp/pip-install-hjqmz7zd/mecab/pip-egg-info
         cwd: /tmp/pip-install-hjqmz7zd/mecab/
    Complete output (10 lines):
    /bin/sh: 1: mecab-config: not found
    Traceback (most recent call last):
      File "&lt;string&gt;", line 1, in &lt;module&gt;
      File "/tmp/pip-install-hjqmz7zd/mecab/setup.py", line 53, in &lt;module&gt;
        include_dirs=cmd2("mecab-config --inc-dir"),
      File "/tmp/pip-install-hjqmz7zd/mecab/setup.py", line 19, in cmd2
        return cmd1(strings).split()
      File "/tmp/pip-install-hjqmz7zd/mecab/setup.py", line 15, in cmd1
        return os.popen(strings).readlines()[0].rstrip()
    IndexError: list index out of range
    ----------------------------------------
ERROR: Command errored out with exit status 1: python setup.py egg_info Check the logs for full command output.
</pre>


<p>
mecab がインストールされていない。
</p>
</div>
</div>

<div id="outline-container-org6b8c509" class="outline-2">
<h2 id="org6b8c509"><span class="section-number-2">5</span> 試行錯誤の手順</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
clothoid@silverstone:~$ sudo apt install mecab
パッケージリストを読み込んでいます... 完了
依存関係ツリーを作成しています                
状態情報を読み取っています... 完了
以下の追加パッケージがインストールされます:
  libmecab2 mecab-jumandic mecab-jumandic-utf8 mecab-utils
以下のパッケージが新たにインストールされます:
  libmecab2 mecab mecab-jumandic mecab-jumandic-utf8 mecab-utils
アップグレード: 0 個、新規インストール: 5 個、削除: 0 個、保留: 4 個。
16.5 MB のアーカイブを取得する必要があります。
この操作後に追加で 219 MB のディスク容量が消費されます。
続行しますか? [Y/n] Y
取得:1 http://jp.archive.ubuntu.com/ubuntu focal/main amd64 libmecab2 amd64 0.996-10build1 [233 kB]
取得:2 http://jp.archive.ubuntu.com/ubuntu focal/main amd64 mecab-utils amd64 0.996-10build1 [4,912 B]
取得:3 http://jp.archive.ubuntu.com/ubuntu focal/universe amd64 mecab-jumandic-utf8 all 7.0-20130310-7 [16.2 MB]
取得:4 http://jp.archive.ubuntu.com/ubuntu focal/universe amd64 mecab-jumandic all 7.0-20130310-7 [2,204 B]
取得:5 http://jp.archive.ubuntu.com/ubuntu focal/universe amd64 mecab amd64 0.996-10build1 [132 kB]
16.5 MB を 3秒 で取得しました (4,850 kB/s)
以前に未選択のパッケージ libmecab2:amd64 を選択しています。
(データベースを読み込んでいます ... 現在 395137 個のファイルとディレクトリがイン
ストールされています。)
.../libmecab2_0.996-10build1_amd64.deb を展開する準備をしています ...
libmecab2:amd64 (0.996-10build1) を展開しています...
以前に未選択のパッケージ mecab-utils を選択しています。
.../mecab-utils_0.996-10build1_amd64.deb を展開する準備をしています ...
mecab-utils (0.996-10build1) を展開しています...
以前に未選択のパッケージ mecab-jumandic-utf8 を選択しています。
.../mecab-jumandic-utf8_7.0-20130310-7_all.deb を展開する準備をしています ...
mecab-jumandic-utf8 (7.0-20130310-7) を展開しています...
以前に未選択のパッケージ mecab-jumandic を選択しています。
.../mecab-jumandic_7.0-20130310-7_all.deb を展開する準備をしています ...
mecab-jumandic (7.0-20130310-7) を展開しています...
以前に未選択のパッケージ mecab を選択しています。
.../mecab_0.996-10build1_amd64.deb を展開する準備をしています ...
mecab (0.996-10build1) を展開しています...
libmecab2:amd64 (0.996-10build1) を設定しています ...
mecab-utils (0.996-10build1) を設定しています ...
mecab-jumandic-utf8 (7.0-20130310-7) を設定しています ...
Compiling Juman dictionary for Mecab.
reading /usr/share/mecab/dic/juman/unk.def ... 37
emitting double-array: 100% |###########################################| 
reading /usr/share/mecab/dic/juman/Noun.koyuu.csv ... 7964
reading /usr/share/mecab/dic/juman/ContentW.csv ... 551145
reading /usr/share/mecab/dic/juman/Assert.csv ... 34
reading /usr/share/mecab/dic/juman/Wikipedia.csv ... 167709
reading /usr/share/mecab/dic/juman/Emoticon.csv ... 972
reading /usr/share/mecab/dic/juman/Noun.suusi.csv ... 49
reading /usr/share/mecab/dic/juman/Noun.keishiki.csv ... 8
reading /usr/share/mecab/dic/juman/AuxV.csv ... 593
reading /usr/share/mecab/dic/juman/Prefix.csv ... 90
reading /usr/share/mecab/dic/juman/Postp.csv ... 108
reading /usr/share/mecab/dic/juman/Special.csv ... 158
reading /usr/share/mecab/dic/juman/Demonstrative.csv ... 97
reading /usr/share/mecab/dic/juman/Noun.hukusi.csv ... 81
reading /usr/share/mecab/dic/juman/Rengo.csv ... 1118
reading /usr/share/mecab/dic/juman/Suffix.csv ... 2128
reading /usr/share/mecab/dic/juman/Auto.csv ... 18931
emitting double-array: 100% |###########################################| 
reading /usr/share/mecab/dic/juman/matrix.def ... 1876x1876
emitting matrix      : 100% |###########################################| 

done!
update-alternatives: /var/lib/mecab/dic/debian (mecab-dictionary) を提供するため
に自動モードで /var/lib/mecab/dic/juman-utf8 を使います
mecab-jumandic (7.0-20130310-7) を設定しています ...
mecab (0.996-10build1) を設定しています ...
man-db (2.9.1-1) のトリガを処理しています ...
libc-bin (2.31-0ubuntu9) のトリガを処理しています ...
</pre>

<p>
これでいいかと思って、やったけどエラー。
</p>

<pre class="example">
clothoid@silverstone:~$ sudo pip3 install mecab
Collecting mecab
  Using cached mecab-0.996.2.tar.gz (62 kB)
    ERROR: Command errored out with exit status 1:
     command: /usr/bin/python3 -c 'import sys, setuptools, tokenize; sys.argv[0] = '"'"'/tmp/pip-install-jenc9kps/mecab/setup.py'"'"'; __file__='"'"'/tmp/pip-install-jenc9kps/mecab/setup.py'"'"';f=getattr(tokenize, '"'"'open'"'"', open)(__file__);code=f.read().replace('"'"'\r\n'"'"', '"'"'\n'"'"');f.close();exec(compile(code, __file__, '"'"'exec'"'"'))' egg_info --egg-base /tmp/pip-install-jenc9kps/mecab/pip-egg-info
         cwd: /tmp/pip-install-jenc9kps/mecab/
    Complete output (10 lines):
    /bin/sh: 1: mecab-config: not found
    Traceback (most recent call last):
      File "&lt;string&gt;", line 1, in &lt;module&gt;
      File "/tmp/pip-install-jenc9kps/mecab/setup.py", line 53, in &lt;module&gt;
        include_dirs=cmd2("mecab-config --inc-dir"),
      File "/tmp/pip-install-jenc9kps/mecab/setup.py", line 19, in cmd2
        return cmd1(strings).split()
      File "/tmp/pip-install-jenc9kps/mecab/setup.py", line 15, in cmd1
        return os.popen(strings).readlines()[0].rstrip()
    IndexError: list index out of range
    ----------------------------------------
ERROR: Command errored out with exit status 1: python setup.py egg_info Check the logs for full command output.
</pre>

<p>
追加で、libmecab-dev
</p>

<pre class="example">
clothoid@silverstone:~$ sudo apt install libmecab-dev
パッケージリストを読み込んでいます... 完了
依存関係ツリーを作成しています                
状態情報を読み取っています... 完了
以下のパッケージが新たにインストールされます:
  libmecab-dev
アップグレード: 0 個、新規インストール: 1 個、削除: 0 個、保留: 4 個。
285 kB のアーカイブを取得する必要があります。
この操作後に追加で 3,112 kB のディスク容量が消費されます。
取得:1 http://jp.archive.ubuntu.com/ubuntu focal/main amd64 libmecab-dev amd64 0.996-10build1 [285 kB]
285 kB を 0秒 で取得しました (1,478 kB/s)
以前に未選択のパッケージ libmecab-dev を選択しています。
(データベースを読み込んでいます ... 現在 395262 個のファイルとディレクトリがイン
ストールされています。)
.../libmecab-dev_0.996-10build1_amd64.deb を展開する準備をしています ...
libmecab-dev (0.996-10build1) を展開しています...
libmecab-dev (0.996-10build1) を設定しています ...
man-db (2.9.1-1) のトリガを処理しています ...
clothoid@silverstone:~$ mecab-config --version
0.996
</pre>

<p>
これで、python の mcab パッケージはインストールできる。
</p>

<pre class="example">
lothoid@silverstone:~$ sudo pip3 install mecab
Collecting mecab
  Using cached mecab-0.996.2.tar.gz (62 kB)
Building wheels for collected packages: mecab
  Building wheel for mecab (setup.py) ... done
  Created wheel for mecab: filename=mecab-0.996.2-cp38-cp38-linux_x86_64.whl size=185686 sha256=c93dd2583ac6ae7c149e1bfb9c590f2b366530f80026681dba30c16332bcc0fb
  Stored in directory: /root/.cache/pip/wheels/b4/0b/fc/3d23954057135d1b09f7d258ca6c071fc25ae227e9825f173b
Successfully built mecab
Installing collected packages: mecab
Successfully installed mecab-0.996.2
</pre>

<p>
パースに -Owakati を指定した場合は問題ないが、-Ochasen を指定した場合は以下のランタイムエラー
</p>

<pre class="example">
Traceback (most recent call last):
  File "2020-09-08-165153.py", line 10, in &lt;module&gt;
    m = MeCab.Tagger("-Ochasen")
  File "/usr/local/lib/python3.8/dist-packages/MeCab.py", line 355, in __init__
    _MeCab.Tagger_swiginit(self, _MeCab.new_Tagger(*args))
RuntimeError
</pre>

<p>
追加で、以下を実施にて解決。
</p>

<pre class="example">
sudo apt install mecab-ipadic mecab-ipadic-utf8
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: clothoid</p>
<p class="date">Created: 2020-09-12 Sat 07:25</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
